wpax-dcqos2/deathstarbench-social-network/2023-04-03T15-57-03UTC/10000R-1700c-5d-150t/wrk2_10000R_1700c_5d_150t_1iteration.txt
Running 5s test @ http://nginx-thrift:8080
  150 threads and 1700 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.54ms    1.73ms  11.70ms   78.49%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.10ms
 75.000%    6.25ms
 90.000%    7.76ms
 99.000%   11.70ms
 99.900%   15.37ms
 99.990%   18.48ms
 99.999%   20.83ms
100.000%   20.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.521     0.000000            1         1.00
       3.885     0.100000         4800         1.11
       4.215     0.200000         9614         1.25
       4.507     0.300000        14385         1.43
       4.795     0.400000        19154         1.67
       5.103     0.500000        23933         2.00
       5.283     0.550000        26381         2.22
       5.475     0.600000        28718         2.50
       5.687     0.650000        31109         2.86
       5.943     0.700000        33521         3.33
       6.251     0.750000        35911         4.00
       6.419     0.775000        37112         4.44
       6.615     0.800000        38297         5.00
       6.835     0.825000        39488         5.71
       7.091     0.850000        40688         6.67
       7.391     0.875000        41878         8.00
       7.571     0.887500        42474         8.89
       7.763     0.900000        43073        10.00
       7.983     0.912500        43668        11.43
       8.247     0.925000        44276        13.33
       8.535     0.937500        44874        16.00
       8.719     0.943750        45171        17.78
       8.911     0.950000        45459        20.00
       9.159     0.956250        45760        22.86
       9.455     0.962500        46062        26.67
       9.775     0.968750        46365        32.00
       9.967     0.971875        46512        35.56
      10.151     0.975000        46654        40.00
      10.367     0.978125        46807        45.71
      10.639     0.981250        46958        53.33
      10.919     0.984375        47106        64.00
      11.127     0.985938        47185        71.11
      11.311     0.987500        47254        80.00
      11.551     0.989062        47328        91.43
      11.791     0.990625        47403       106.67
      12.103     0.992188        47478       128.00
      12.303     0.992969        47514       142.22
      12.479     0.993750        47552       160.00
      12.735     0.994531        47590       182.86
      13.007     0.995313        47627       213.33
      13.367     0.996094        47664       256.00
      13.535     0.996484        47682       284.44
      13.775     0.996875        47702       320.00
      13.895     0.997266        47720       365.71
      14.167     0.997656        47738       426.67
      14.359     0.998047        47757       512.00
      14.575     0.998242        47766       568.89
      14.815     0.998437        47776       640.00
      14.983     0.998633        47785       731.43
      15.135     0.998828        47794       853.33
      15.399     0.999023        47804      1024.00
      15.463     0.999121        47808      1137.78
      15.583     0.999219        47813      1280.00
      15.759     0.999316        47818      1462.86
      15.927     0.999414        47822      1706.67
      16.303     0.999512        47828      2048.00
      16.311     0.999561        47829      2275.56
      16.343     0.999609        47832      2560.00
      16.415     0.999658        47834      2925.71
      16.639     0.999707        47837      3413.33
      16.879     0.999756        47839      4096.00
      16.959     0.999780        47840      4551.11
      17.087     0.999805        47841      5120.00
      17.503     0.999829        47842      5851.43
      18.239     0.999854        47843      6826.67
      18.479     0.999878        47845      8192.00
      18.479     0.999890        47845      9102.22
      18.815     0.999902        47846     10240.00
      18.815     0.999915        47846     11702.86
      19.791     0.999927        47847     13653.33
      20.063     0.999939        47848     16384.00
      20.063     0.999945        47848     18204.44
      20.063     0.999951        47848     20480.00
      20.063     0.999957        47848     23405.71
      20.527     0.999963        47849     27306.67
      20.527     0.999969        47849     32768.00
      20.527     0.999973        47849     36408.89
      20.527     0.999976        47849     40960.00
      20.527     0.999979        47849     46811.43
      20.831     0.999982        47850     54613.33
      20.831     1.000000        47850          inf
#[Mean    =        5.543, StdDeviation   =        1.731]
#[Max     =       20.816, Total count    =        47850]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  48002 requests in 5.01s, 547.77MB read
Requests/sec:   9588.06
Transfer/sec:    109.41MB